/*
根据下面关系式，求圆周率的值，直到最后一项的值小于给定阈值。
​2
​
​π
​​=1+
​3
​
​1
​​+
​3×5
​
​2!
​​+
​3×5×7
​
​3!
​​+⋯+
​3×5×7×⋯×(2n+1)
​
​n!
​​+⋯
输入格式：
输入在一行中给出小于1的阈值。
输出格式：
在一行中输出满足阈值条件的近似圆周率，输出到小数点后6位。
输入样例：
0.01
输出样例：
3.132157
*/
#include<stdio.h>
int main(){
    double min,pi;
    double fz,fm;
    fz=1.0;
    fm=1.0;
    pi=2.0;
    scanf("%lf",&min);
    for(int i=1;fz/fm>min;i++){
        fz=i*fz;
        fm=fm*(2*i+1);
        pi=pi+fz/fm*2;
    }
    printf("%.6lf",pi);
    return 0;

}